vaidyaḥ
sarvato-mukhaḥ
samīhanaḥ
anilo
śrīdharaś
pratiṣṭhitaḥ
gabhasti-nemiḥ
akṣobhyaḥ
vājasanaś
surādhyakṣo
sarvagaḥ
catur-bāhuś
mānyo
suvarṇa-bindur
saṃvatsaro
cakrī
sarva
dur-atikramaḥ
dhuryo
vyālaḥ
sadāmarṣī
pranavaḥ
anādir
somaḥ
śaṅkha-bhṛn
anantātmā
sat-path-ācāraḥ
ādityo
pāvano'nalaḥ
ādi-devo
viśva-bhug
mahārhas
mahā-buddhir
catur-veda-vid
svābhāvyo
jagatas-setuḥ
purandaraḥ
adbhutaḥ
sūkṣmas
sandhātā
śrīnivāsaḥ
su-locanaḥ
medinī-patiḥ
suvratas
mahā-devo
amūrtimān
vikṣaro
catur-bhāvaś
śikhaṇḍī
abhiprāyaḥ
brahma-kṛd-brahmā
mano-javas
kāma-pālaḥ
savitā
ādidevaḥ
skandaḥ
trilok-ātmā
vyavasthānaḥ
'ravindākṣaḥ
dhanur-vedo
vīra-bāhur
sarva-lakṣaṇa-lakṣaṇyo
sahasrajid
vidhātā
agraṇīr
ojas-tejo-dyuti-dharaḥ
amṛtāśo
kṛtānta-kṛt
vīro
gadādharaḥ
ṛtuḥ
apāṃ-nidhir
dṛḍhas
akrūraḥ
viśvātmā
catur-gatiḥ
siddhis
manus
vikramī
yamaḥ
mahā-dyutiḥ
siṃhaḥ
ksamiṇāṃ-varaḥ
śrīkaraś
dhātā
bhrājiṣṇur
suṣeṇaḥ
adhokṣajaḥ
kṛta-lakṣaṇaḥ
vyavasāyo
virocanaḥ
neyo
puruṣaḥ
brahma-vid
jñāna-gamyaḥ
mahoragaḥ
pavitraṃ
mahā-śṛṅgaḥ
ravi-locanaḥ
sthāvara
mukundo'mita-vikramaḥ
loka-sāraṅgas
mahā-kramo
bhūri-dakṣiṇaḥ
lakṣmīvān
kṛtākṛtaḥ
sarva-kāmadaḥ
aśokas
vegavān
śrīśaś
keśihā
gadī
amoghaḥ
anirdeśya-vapuḥ
bhūtā-vāso
hariḥ
śāntiḥ
ajo
dharma-yūpo
'niyamo
bheṣajaṃ
bhū-garbho
govindas
yajña-vāhanaḥ
viśiṣṭaḥ
vṛṣa-parvā
kāntaḥ
avyaktaḥ
naika-rūpo
varāroho
nandakī
prabhūtas
govidāṃ-patiḥ
acyutaḥ
tejo-vṛṣo
śoka-nāśanaḥ
sākṣī
śarīra-bhṛt
annam
'mṛta-vapuḥ
śāśvataḥ
sahasrārcis
deveśo
sumedhā
sahasra-mūrdhā
mahākośo
pradyumno
siṃho
gabhīro
upendro
śat-ānanaḥ
prāg-vaṃśo
bhāskara-dyutiḥ
nahuṣo
dur-gamo
parājitaḥ
vāsudevo
ṛddho
hetur
satya-dharma-parāyaṇaḥ
vṛkṣaḥ
sarva-darśanaḥ
sulabhas
ayonijaḥ
dakṣiṇaḥ
viṣṇur
bhāvano
suvarṇa-varṇo
śrīvatsa-vakṣāś
jana-janmādir
śaśi-binduḥ
damaḥ
prakāśanaḥ
āvartano
udīrṇaḥ
dāśārhas
arcitaḥ
bhūta-maheśvaraḥ
kundaraḥ
jñānam-uttamam
nyagrodho-duṃbaro
aniruddho
dṛpto
svayam-jāto
prabhavaḥ
vāgmī
mahejyaśca
nyāyo
'thā
'raḥ
yajña-kṛd
naikado
dhāma
cchuciḥ
bhūṣaṇo
sarvajño
sattvasthas
maṅgalaṃ-param
naika-karma-kṛt
saṃsthānaḥ
śrīvāsaś
nārāyaṇo
garuḍa-dhvajaḥ
nimiṣo'nimiṣaḥ
nandano
prapitāmaḥ
sad-bhūtiḥ
ekā
guṇa-bhṛn
mahā-tejo
vṛṣabhākṣo
vijitātmā
bhīmaḥ
vaṣaṭkāro
bhoktā
guptaś
bhīma-parākramaḥ
viśva-sṛṭ
sukhado
mahāśanaḥ
dāmodaraḥ
yogo
babhrur
anagho
vikramaḥ
priya-kṛt
vistāraḥ
jetā
śāstā
tāraḥ
śarīra-bhūta-bhṛd
sthāṇu
janano
vinayo
sudarśanaḥ
suhṛt
pratyayaḥ
kapilaḥ
sureśvaraḥ
bhayāpahaḥ
spaṣṭākṣaro
nayo
vidvittamo
haviḥ
sahasra-pāt
sundaras
kuvaleśayaḥ
satraṃ
sad-gatiḥ
parigrahaḥ
'vidheyātmā
sthaviṣṭho
vyādiśo
sat-kṛtiḥ
durārihā
lokādhiṣṭhānam
tantu-vardhanaḥ
anantarūpo
kapir-avyayaḥ
madhu-sūdanaḥ
padma-nibhekṣaṇaḥ
śūnyo
sādhur
ṛddhaḥ
mahādhanaḥ
sūryaḥ
vāmanaḥ
'ntakaḥ
śaktimatāṃ-śreṣṭho
viśodhanaḥ
bhaya-kṛd
vasu-retā
kālaḥ
bhūtātmā
santo
udbhavaḥ
siddhidaḥ
sanāt
vikartā
bhaya-nāśanaḥ
śipiviṣṭaḥ
sarvajña
tattvaṃ
puṇyo
vaikhānas
asaṅkhyeyo
bhānuḥ
oṃ
bhūr
punarvasuḥ
vyāpto
ātmā-yoniḥ
atīndriyo
su-rucir
virāmo
gopatir
śāśvata-sthiraḥ
duṣkṛtihā
siddhārthaḥ
sāttvikas
mahā-hṛado
mahābhāgo
'nandī
bhūśayo
janeśvaraḥ
śiṣṭeṣṭaḥ
bhavat-prabhuḥ
stotā
amṛtaḥ
avijñātā
prāṇaḥ
vedyo
prāṇadaḥ
vāsudevaḥ
sat-parāyaṇaḥ
ratna-garbho
durjayo
kṣitīśaḥ
guhyo
hiraṇya-garbhaḥ
puru-jit
ūrdhvagas
svasti-bhuk
samāvarto
vāyur
viśvaretāḥ
sarva-yoga-viniḥ-sṛtaḥ
sat-kīrtiś
prāṃśur
naika-śṛṅgo
muktānāṃ
kathito
brahmajño
sthāṇuḥ
mahā-makhaḥ
kāmaḥ
netā
sat-kṛtaḥ
medhajo
sumukhas
sarvavid
sandhimāṃ
vāsavānujaḥ
bṛhat
'bhirakṣatu
kāmī
śravaṇaḥ
vasu-manā
san-nivāsaḥ
jyotir-ādityaḥ
bhūr-bhuvas-svas-tarus
nigraho
cakra-gadā-dharaḥ
amṛtyuḥ
maha-rṣiḥ
vasumanās
praharaṇāyudhaḥ
cāṇūr-āndhra-niṣūdanaḥ
anīśaḥ
loka-bandhur
'nanto
janārdanaḥ
sarvasaho
yajñāṅgo
sarva-vāgīśvar-eśvaraḥ
vatsī
śatrughno
īśvaro
anirviṇṇas
araudraḥ
prabhurīśvaraḥ
bhūtir
gohito
adhiṣṭhānam
mādhavo
krodhahā
sanātana-tamaḥ
puru-sattamaḥ
daṇḍo
samātmā'saṃmitas
kanakāṅgadī
kaviḥ
devaḥ
śreyaś-śrīmāṃ
vihāyasa-gati
pratāpanaḥ
kāma-pradaḥ
sahiṣṇur
kṣetrajño'kṣara
krodha-kṛt
anivartī
sattvavān
jita-manyur
divas-spṛk
suprasādaḥ
padmanābha'mara-prabhuḥ
nakṣatra-nemir
aja–
sāttvatāṃ-patiḥ
lakṣmīs
yajñī
bhāra-bhṛt
yugāvarto
kratus
sāma-gāyanaḥ
vṛṣaḥ
chamaś
varuṇo
adṛśyo
prāṇa-nilayaḥ
hemāṅgo
saṅkarṣaṇo
eva
padam-anuttamam
sthūlo
dakṣo
yoga-vidāṃ
śṛṅgī
mahākṣo
sarva-dṛk
yajña
amṛtāṃśūdbhavo
aparājitas
kṣobhaṇo
sukhadas
sañyāsa-kṛc
satyaḥ
durādharṣaḥ
khaṇḍa-paraśur
chinna-saṃśayaḥ
nama
avyayaḥ
jīvo
calaḥ
ādhāra-nilayo
bhīmo
amūrtir
pary-avasthitaḥ
pararddhiḥ
dhaneśvaraḥ
sāma-gas
vīta-bhayaḥ
vedo
stotraṃ
suyāmunaḥ
svakṣaś
bhūta-kṛd
brahmaṇyo
parjanyaḥ
kṛtāgamaḥ
aprameyo
panaḥ
udbhavas
bhūta-bhṛd
prāṇo
diśaḥ
vasu-pradaḥ
apramataḥ
dhanañjayaḥ
virato
kundaḥ
amānī
tri-daśādhyakṣo
śrī-vibhāvanaḥ
kuṇḍalī
prakāśātmā
mahān
kṣemakṛc-chivaḥ
kramaḥ
naika-māyo
bṛhad-bhānur
śubhekṣaṇaḥ
ravir
śūra-jan-eśvaraḥ
hiraṇya-garbho
saṃkṣeptā
kumbho
trilok-eśaḥ
dhanvī
kāma-devaḥ
sutapāḥ
saṃpra-mardanaḥ
tuṣṭaḥ
kāla-nemi-nihā
anantajit
śārṅga-dhanvā
samaḥ
varado
ānando
svāsyaḥ
vyakata-rūpaśca
kṛtirātmavān
'prati-rathaḥ
jita-krodho
viviktaḥ
mānado
ugraḥ
puṇya-śravaṇa-kīrtanaḥ
bhakta-vatsalaḥ
śuci-śravāḥ
anirdeśya-vapur
śāśvata
duḥ-svapna-nāśanaḥ
sarvavijjayī
caturaśro
śrīnivāsaś
mahī-bhartā
sarva-darśī
maharddhir
damano
nidhir
bhāvo
tat
padma-nābha
yajña-sādhanaḥ
ekapāt
'nartho
lohitākṣaḥ
viśrutātmā
bhagavān
puṇyakīrtir
vīrahā
śata-mūrtiś
svavaśo
draviṇa-pradaḥ
sthānado
mahī-dharaḥ
vimuktātmā
pāpa-nāśanaḥ
ahas
pavanaḥ
rāmo
padma-garbhaḥ
bhūta-bhavya-bhavan-nāthaḥ
kumudaḥ
āgrāhyaḥ
sarva-śastra-bhṛtāṃ-varaḥ
vṛṣabho
ghṛtāśīr
sāma
uttāraṇo
vyāpī
bhojanaṃ
vatsalo
'nilaḥ
prajāgaraḥ
vidāraṇaḥ
brahma
sraṣṭā
pūrayitā
arciṣmān
suparṇo
satya-medhā
viśuddh-ātmā
suvīro
mahā-tapāḥ
sureśaḥ
janma-mṛtyu-jarātigaḥ
niyamo
jyeṣṭhaḥ
durgo
jayantas
yajña-guhyaṃ
lokatry-āśrayaḥ
prajāpatiḥ
purātanaḥ
dur-āvāso
havir-hariḥ
prāṇa-jīvanaḥ
pramodanaḥ
vācaspatir
grāmaṇīḥ
puṣkarākṣo
kapilācāryaḥ
svasti-daḥ
rakṣaṇaḥ
catur-bhujaḥ
atulaḥ
puṇyaḥ
auṣadhaṃ
mahā-bhāgo
dharma-gub
vardha-mānaśca
haṃsaḥ
anirviṇṇaḥ
śreṣṭhaḥ
deva-bhṛd
maha-bhūto
mahendro
sattā
tāras
dyuti-dharaḥ
medhāvī
mahā-mūrtir
śatānando
'śvatthaś
vidiśo
bṛhad-rūpaḥ
mahābalaḥ
vedāṅgo
samīraṇaḥ
tāraṇas
śrīmatāṃ-varaḥ
dāruṇo
yajño
darpahā
sarvadṛg
śūraḥ
stutiḥ
kiṃ
loka-nātho
brahmī
catur-vyūhaś
sapta-vāhanaḥ
gahano
mahādridhṛk
prasann-ātmā
kāmahā
brāhmaṇo
śarma
nirguṇo
kṛtajño
pragraho
puruṣeśvaraḥ
śarabho
ananta-huta-bhuk-bhoktā
sargo
bhagahā
sad-akṣaram
rucirāṅgadaḥ
viśvakarmā
rudro
mahā-vīryo
tattva-vid
samvṛtaḥ
sthiraḥ
pāvano
śiśiraś
jīvanaḥ
puṣpa-hāsaḥ
triloka-dhṛk
satyas
puṇḍarīkākṣo
dharmo
sadāyogī
loka-svāmī
aneka-mūrtir
nakṣatrī
guhaḥ
yajña-patir
gabhīrātmā
śabdātigaś
aṇur
ratna-nābhas
śarvaḥ
mahā-svanaḥ
vṛṣa-karmā
sragvī
ahas-saṃvartako
śānto
kapīndro
samitiñjayaḥ
śauriḥ
hrṣīkeśaḥ
viśvakseno
subhujo
mantraś
nirvāṇaṃ
dīpta-mūrtir
asat-kṣaram
pramāṇaṃ
canda-nāṅgadī
candrāṃśur
vahnir
prāṇado
mahotsāho
siddha-saṅkalpaḥ
durmarṣaṇaḥ
vibhuḥ
yat
svadhṛtas
mahā-yajvā
viṣamaḥ
mano-haro
ijyo
svayaṃbhūḥ
śaraṇaṃ
sthaviṣṭhaḥ
vaikuṇṭhaḥ
ūrjitaḥ
vanamālī
devakī-nandanas
varāṅgaś
śivaḥ
yajvā
'yamaḥ
'mita-vikramaḥ
prāṇa-bhṛt
parameśvaraḥ
trivikramaḥ
bhūtādir
śāntidas
surānando
śrīdaś
trikakub-dhāma
dhātur-uttamaḥ
śaurir
dharma-kṛd
saṃgrahaḥ
'jitaḥ
artho
'cintyo
peśalo
vāruṇo
śubhāṅgo
prīti-vardhanaḥ
bhartā
iṣṭo'viśiṣṭaḥ
yajña-bhṛt
annāda
hiraṇya-nābha
sarvaḥ
kāraṇaṃ
prabhuḥ
śaṃbhūr-ādityaḥ
anādi-nidhano
priyārho
mahī-dharo
brahma-vivardhanaḥ
tri-padas
saptaidhās
keśavaḥ
mahā-kratur
dhanyaḥ
arko
viśvaṃ
bhiṣak
dhanur-dharo
sarvataś-cakṣur
'cyutaḥ
sarvādir
iti
nivṛttātmā
bhujagottamaḥ
bahuśirā
mahā-nidhiḥ
kṛtajña
ekātmā
halāyudhaḥ
avyayam
vyāso
vardhano
vīraḥ
puruṣottamaḥ
gopatir-goptā
mahā-haviḥ
yogī
bhūta-bhāvanaḥ
vṛṣākṛtiḥ
'pramey-ātmā
vṛṣapriyaḥ
sthaviro
vasu-prado
naikas
naraḥ
śrī-garbhaḥ
pradhāna
jayaḥ
svāpanas
acalaś
catur-ātmā
prathitaḥ
'grajaḥ
maheṣvāso
sarvāsu-nilayo
uttaro
viśva-bāhur
yajña-bhug
vasur
damayitā
skanda-dharo
viśokaḥ
nanta-śrīr
ca
satya-sandho
kṛta-karmā
jyotir-gaṇeśvaraḥ
karaṇaṃ
dhruvaḥ
vapuḥ
bhūr-bhuvo
durdharo
gati-sattamaḥ
prāṇa-daḥ
tri-sāmā
mahā-śaktir
pūrṇaḥ
parameṣṭhī
mahā-varāho
ameyātmā
śucir
vikramy-ūrjita-śāsanaḥ
vṛṣāhī
śaṅkhī
mahā-karmā
mārgo
svasti
pūtātmā
sthāṇur
aniruddhaḥ
surārihā
śrīmān
jyotiḥ
satya-dharmā
avyaṅgo
dharmī
rohito
caturātmā
śatrujic-chatru-tāpanaḥ
satya-parākramaḥ
stavyaḥ
anukūlaḥ
gadāgrajaḥ
madhuḥ
jagad-ādijaḥ
dur-labho
vṛddhātmā
nandas
vasuḥ
marīcir
vṛṣā-kapir
niṣṭhā
śruti-sāgaraḥ
mahā-garto
siddhas
yadu-śreṣṭhaḥ
śiṣṭha-kṛt
anuttamo
praṇamaḥ
indrakarmā
kṣamaḥ
dhṛtātmā
sa-vaḥ
śārngī
svasti-kṛt
vyagro
viśva-mūrtir
udāra-dhīḥ
vāyu-vāhanaḥ
śrīnidhiś
padmī
nandi
paramāgatiḥ
stava-priyaḥ
āśramaś
yugādi-kṛd
yajñānta-kṛd
'nayaḥ
adhṛtas
sama-yajño
narasiṃha
guruḥ
mahāmāyo
sarveśvaras
siddhaś
jitāmitraḥ
huta-bhug-vibhuḥ
anāmayaḥ
'nalaḥ
naikātmā
raṇapriyaḥ
rathāṅga-pāṇir
mahāmanāḥ
sutantus
śabda-sahaś
saṃbhavo
sahasrāṃśur
kāma-kṛt
paramātmā
bhūtabhavya
goptā
bhānur
svaṅgaś
kaḥ
tvaṣṭā
aṃbho-nidhir
brāhmaṇa-priyaḥ
parāyaṇam
sahaḥ
atīndraḥ
svasti-dakṣiṇaḥ
sahasrākṣaḥ
parama-spaṣṭas
kartā
sughoṣas
su-dhanvā
vasudo
sundo
sapta-jihvas
niyantā
kṛśaḥ
satāṅ-gatiḥ
kṣāmas
puṣṭhaḥ
yogīśas
śūra-seno
vijayo
lokādhyakṣaḥ
darpado
śrīpatiś
prajā-bhavaḥ
dharma-vid-uttamaḥ
dharmādhyakṣaḥ
śarvarī-karaḥ
satya-dharma-parākramaḥ
maho-dadhi-śayo
bījam
siddhi-sādhanaḥ
vaṃśa-vardhanaḥ
jahnur
śubhāṅgaś
vedhās
śatāv-artaḥ
sat-kartā
kṛṣṇo
vedavid
vṛṣodaraḥ
mahā-yajño
vatsaro
dharaṇī-dharaḥ
govindo
padma-nābho
somapo'mṛtapas
viśrāmo
gurur-guru-tamo
pratardanaḥ
catur-daṃṣtraś
svāṅgo
pṛthuḥ
viśvadakṣiṇaḥ
dharā-dharaḥ
īśānaḥ
viśva-yoniḥ
amitāśanaḥ
catur-mūrtiś
tīrtha-karo
vinayitā
UNK
EOS