sarvajna
sarvesvaras
samvrtah
satrughno
visvam
bijam
catur-murtis
srinivasas
vahnir
saksi
kesiha
purusottamah
ravindaksah
suci-sravah
durmarsanah
padmi
dharmadhyaksah
sri-vibhavanah
taras
bhima-parakramah
parigrahah
catur-atma
kapilah
bhavat-prabhuh
punya-sravana-kirtanah
sarva-darsanah
sipivistah
adi-devo
suryah
arko
gabhasti-nemih
dhanur-dharo
trikakub-dhama
vrsah
anirvinnas
urdhvagas
anuttamo
sasi-binduh
prapitamah
yajna-vahanah
janesvarah
sthavistho
durariha
maha-svanah
manado
medhavi
soka-nasanah
vyavasayo
mahejyasca
anisah
drpto
sthulo
aparajitas
amurtiman
purusah
sragvi
sat-parayanah
govindas
duh-svapna-nasanah
chamas
prana-dah
sargo
amrtaso
svayambhuh
prabhutas
krtajno
sreyas-srimam
tri-dasadhyakso
gopta
yat
samksepta
hrsikesah
vedyo
krta-karma
vijitatma
dhuryo
catur-gatih
sattvasthas
disah
ksaminam-varah
maha-havih
adidevah
isvaro
paramesthi
rohito
ravir
margo
catur-vyuhas
panah
nalah
maha-bhuto
sarva-vagisvar-esvarah
nyagrodho-dumbaro
savita
vidhata
manus
brahma-vivardhanah
guna-bhrn
vinayo
daksinah
laksmivan
anur
aneka-murtir
suhrt
prajagarah
vacaspatir
cakri
jagad-adijah
nivrttatma
dharma-yupo
kratus
vikrami
bhu-garbho
nahuso
nirvanam
padma-nabha
suviro
madhu-sudanah
pramey-atma
candramsur
sahah
vyakata-rupasca
brhad-bhanur
anivarti
vidaranah
aprameyo
sthirah
pratyayah
vasavanujah
mukundo
sarva
vyagro
kumudah
bhusayo
srimatam-varah
sarira-bhrt
krsno

canda-nangadi
artho
niyamo
vrsabho
bhavo
durjayo
nimiso
visnur
bharta
gabhiratma
amrtah
svasyah
rtuh
agranir
bhusano
priyarho
apramatah
maharddhir
svasti-daksinah
vanamali
catur-bhavas
ahas
sammitas
dharani-dharah
pesalo
tarah
srisas
lokadhyaksah
samvatsaro
adhara-nilayo
maha-tejo
satyas
suyamunah
sarva-laksana-laksanyo
yogisas
sanatana-tamah
arcisman
harih
asokas
bhujagottamah
ranapriyah
vijayo
jana-janmadir
atma-yonih
durdharo
lohitaksah
sattvatam-patih
simhah
guptas
lokadhisthanam
visva-yonih
nirguno
gurur-guru-tamo
sistha-krt
maha-srngah
ratna-nabhas
trilok-esah
maha-bhago
nidhir
suvarna-bindur
vyalah
jahnur
mahakso
maha-garto
sad-bhutih
sad-gatih
priti-vardhanah
vamanah
sattvavan
bhuri-daksinah
tantu-vardhanah
maha-makhah
prakasanah
bhojanam
prabhavah
bhanur
suprasadah
maha-devo
tirtha-karo
hetur
calah
gabhiro
amurtir
maharhas
adbhutah
mahoragah
ratna-garbho
yajna-sadhanah
padmanabha
sarva-darsi
vidvittamo
bhuta-bhavanah
santih
kapir-avyayah
sumukhas
ijyo
yajna-bhrt
sahasramsur
jita-manyur
dakso
neyo
vatsi
stava-priyah
kama-krt
udbhavas
ekatma
avartano
krtanta-krt
sudarsanah
sughosas
sata-murtis
sarvavid
vasu-mana
dur-labho
simho
vasuh
prabhuh
vasu-prado
ayonijah
gramanih
damayita
visamah
sat-krtah
sankha-bhrn
san-nivasah
virocanah
nilah
visva-bhug
janano
visuddh-atma
cintyo
gadi
paramagatih
laksmis
raksanah
ekapat
siddha-sankalpah
sarva-drk
vikarta
bhaya-krd
purandarah
mrta-vapuh
sahasra-murdha
tattvam
svayam-jato
ravi-locanah
sikhandi
dhanur-vedo
srivatsa-vaksas
yajnanta-krd
kramah
vamsa-vardhanah
mano-haro
naikatma
ramo
sarira-bhuta-bhrd
sahasraksah
vrksah
sarva-kamadah
avyayam
vikramah
sapta-vahanah
kama-devah
stutih
amrtamsudbhavo
maha-dyutih
sat-kirtis
vyadiso
brhad-rupah
vrsodarah
vaikunthah
ambho-nidhir
pranah
bhuta-vaso
naikado
havir-harih
dur-avaso
bhimo
tha
naksatra-nemir
parjanyah
cchucih
svasti
aniruddho
sadamarsi
visvaretah
sapta-jihvas
ntakah
naika-karma-krt
gadadharah
paramatma
bhara-bhrt
brahmi
satta
hiranya-garbho
kantah
yoga-vidam
sat-karta
sumedha
bhur
vasu-pradah
sandhata
pranado
gopatir-gopta
guhyo
pratapanah
asramas
vasur
devaki-nandanas
adityo
pragraho
prabhurisvarah
gadagrajah
padma-nibheksanah
vedango
rah
canur-andhra-nisudanah
udirnah
visodhanah
praharanayudhah
kuvalesayah
duskrtiha
vidheyatma
aksobhyah
surah
bhanuh
susenah
bhuta-mahesvarah
araudrah
sambhavo
vyavasthanah
papa-nasanah
apam-nidhir
loka-natho
medini-patih
sanat
brahmanyo
cakra-gada-dharah
su-rucir
naika-mayo
sutapah
ksobhano
sridharas
parama-spastas
adhoksajah
kamah
bhokta
ksetrajno
krodhaha
maha-nidhih
upendro
nanta-srir
paramesvarah
kapindro
vatsalo
pradyumno
sthanu
sarvajno
sampra-mardanah
yajna-krd
su-locanah
yugadi-krd
sarvah
vaikhanas
sanyasa-krc
vegavan
sarabho
rddhah
sasvata-sthirah
vibhuh
drdhas
ksara
govidam-patih
visvakseno
jnana-gamyah
yogo
vajasanas
vrddhatma
amrtyuh
bhaskara-dyutih
sistestah
uttarano
udbhavah
suvratas
viviktah
dhama
mahakoso
su-dhanva
maho-dadhi-sayo
om
avyayah
mrtapas
acalas
sarnga-dhanva
srasta
mahadridhrk
pary-avasthitah
nartho
saptaidhas
tri-sama
visokah
prati-rathah
hiranya-nabha
bhutatma
nayah
mangalam-param
subheksanah
sukhadas
ksitisah
halayudhah
pranavah
bhayapahah
anirdesya-vapur
isanah
somah
sarngi
adhisthanam
pavitram
viramo
catur-bhujah
dravina-pradah
tri-padas
punyakirtir
kundali
vardha-manasca
jnanam-uttamam
sukhado
dasarhas
yugavarto
jita-krodho
loka-sarangas
purusesvarah
saurih
damah
maha-kramo
arcitah
trilok-atma
bhuta-bhrd
niyanta
tat
maha-tapah
mahabhago
mahi-dharah
sahasrajid
nandaki
prasann-atma
mahan
sutantus
svadhrtas
adrsyo
krtajna
sulabhas
vihayasa-gati
puratanah
amani
mahadhanah
dhanesvarah
madhavo
rudro
pratardanah
vita-bhayah
bhutabhavya
jayantas
caturasro
kavih
mahi-bharta
sthavara
jyotir-ganesvarah
maricir
ojas-tejo-dyuti-dharah
viro
sasvata
srinivasah
sarvadir
yajna-bhug
catur-veda-vid
maha-buddhir
nanto
sasta
prakasatma
purayita
vrsakrtih
avyaktah
svapanas
daruno
samsthanah
visva-bahur
sabdatigas
parajitah
punarvasuh
brahma-krd-brahma
satya-parakramah
padma-garbhah
visramo
jivo
puru-sattamah
sarva-sastra-bhrtam-varah
vrsahi
sunyo
sama-gas
somapo
svavaso
bhrajisnur
babhrur
kundah
dhata
vira-bahur
brahma
yajna-guhyam
samihanah
bhisak
ksamas
dhanyah
kumbho
anadir
srikaras
suresah
sahasra-pat
isto
prano
dur-gamo
srngi
skanda-dharo
lokatry-asrayah
sresthah
kanakangadi
durgo
sama-yajno
prana-nilayah
jitamitrah
vyaso
rucirangadah
puskarakso
maha-rsih
cyutah
pavanah
yamah
satram
punyah
vasumanas
tejo-vrso
brahmana-priyah
prana-jivanah
damano
anirvinnah
jyesthah
deveso
annam
vagmi
sat-krtih
bhur-bhuvas-svas-tarus
dyuti-dharah
dhanvi
maha-murtir
svangas
svatthas
vidiso
naika-rupo
mahotsaho
vedo
suresvarah
taranas
sripatis
khanda-parasur
yajno
darpaha
divas-sprk
ugrah
stotram
kah
loka-bandhur
brahmano
catur-bahus
vrsapriyah
gahano
ameyatma
subhangas
krta-laksanah
brahma-vid
sarma
akrurah
kapilacaryah
sura-jan-esvarah
pradhana
atulah
ananta-huta-bhuk-bhokta
sarva-yoga-vinih-srtah
janardanah
dharmi
trivikramah
visvakarma
maha-viryo
sambhur-adityah
vararoho
sandhimam
kundarah
sisiras
jivanah
puspa-hasah
loka-svami
sattvikas
amoghah
saktimatam-srestho
vaidyah
manyo
anantajit
naksatri
guhah
yajna-patir
satya-dharma-parakramah
ksemakrc-chivah
krsah
sundo
samatma
bhagaha
pundarikakso
ausadham
pramodanah
santo
vimuktatma
pusthah
virah
pavano
santidas
sat-ananah
spastaksaro
sama
dipta-murtir
sad-aksaram
pramanam
hemango
mantras
ahas-samvartako
prathitah
mahamayo
siddharthah
ajo
visva-srt
kim
adhrtas
maha-kratur
viraha
dharma-vid-uttamah
yajna
kami
saranam
sthavisthah
triloka-dhrk
sucir
hiranya-garbhah
bhuta-krd
suvarna-varno
sivah
yajva
nyayo
mita-vikramah
prana-bhrt
sri-garbhah
nandas
bhutadir
mano-javas
suranando
sridas
agrahyah
dhatur-uttamah
saurir
dharma-gub
samgrahah
svango
satya-dharma
anagho
punyo
varuno
varangas
priya-krt
bhavano
mara-prabhuh
vayu-vahanah
yajnango
padam-anuttamam
samah
karanam
kama-pradah
bhagavan
anadi-nidhano
abhiprayah
mahi-dharo
vinayita
guruh
vrsabhakso
vapuh
sama-gayanah
medhajo
garuda-dhvajah
samiranah
bhesajam
bhiraksatu
sarvatas-caksur
sankarsano
siddhis
nama
samavarto
hamsah
bahusira
annada
duradharsah
tattva-vid
kama-palah
vistarah
sarvadrg
vardhano
kala-nemi-niha
kesavah
uttaro
maha-yajno
kathito
dhananjayah
vrsa-karma
asankhyeyo
gohito
sthaviro
pratisthitah
eka
narayano
devah
neta
jayah
satya-dharma-parayanah
ghrtasir
gati-sattamah
acyutah
grajah
mahesvaso
vasudevah
krtagamah
krodha-krt
yajni
vasudevo
dando
skandah
bhutir
anantarupo
eva
satya-sandho
maha-karma
nandi
bhakta-vatsalah
dhruvah
narasimha
bhur-bhuvo
subhujo
jyotir-adityah
sat-path-acarah
narah
maha-saktir
purnah
kalah
maha-varaho
sriman
pramsur
vikramy-urjita-sasanah
prthuh
vayur
indrakarma
virato
svasti-krt
surariha
sthanur
aniruddhah
visrutatma
anirdesya-vapuh
jyotih
nandano
avyango
dharma-krd
viksaro
caturatma
satrujic-chatru-tapanah
satyah
chinna-samsayah
prajapatih
naika-srngo
sadayogi
sahisnur
iti
rddho
anando
vasudo
krtiratmavan
vrsa-kapir
nistha
sruti-sagarah
maha-hrado
aja-
yadu-sresthah
visistah
urjitah
pranadah
janma-mrtyu-jaratigah
ksamah
dhrtatma
naikas
vyapto
svasti-dah
nigraho
visva-murtir
nimisah
suparno
srinidhis
satav-artah
satanando
muktanam
stavyah
havih
dur-atikramah
varado
nayo
sarvavijjayi
bhimah
bhaya-nasanah
deva-bhrd
atindriyo
udara-dhih
siddhas
svabhavyo
huta-bhug-vibhuh
anamayah
sarvasu-nilayo
vyapi
stota
puru-jit
mahamanah
subhango
sabda-sahas
mahasanah
avijnata
kamaha
putatma
vasatkaro
gopatir
sarvagah
svaksas
sa-vah
tvasta
mahabalah
brahmajno
parayanam
damodarah
atindrah
svasti-bhuk
visvatma
pararddhih
karta
suksmas
krtakrtah
mahendro
sundaras
sahasrarcis
sarvasaho
brhat
satan-gatih
sravanah
tustah
yogi
sura-seno
sthanado
siddhi-sadhanah
darpado
srivasas
praja-bhavah
dharmo
suradhyakso
sarvari-karah
jagatas-setuh
anantatma
sthanuh
siddhidah
prag-vamso
sadhur
vasu-reta
ca
anukulah
asat-ksaram
jitah
vedavid
vrsa-parva
maha-yajva
vatsaro
anilo
govindo
padma-nabho
samitinjayah
visvadaksinah
sarvato-mukhah
sasvatah
catur-damstras
vedhas
pranamah
bhuta-bhavya-bhavan-nathah
satya-medha
dhara-dharah
jeta
amitasanah
madhuh
sankhi
rathanga-panir
UNK
EOS